brew "vim"

# Shell
brew "aspell"
brew "coreutils"
brew "fzf"
brew "grep"
brew "mprocs"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "wget"
brew "direnv"

# Formatters
brew "prettier"
brew "stylua"
brew "typos-cli"

# Version Control
brew "git"

# Languages
brew "elixir"
brew "expert"
brew "gleam"
brew "kerl"
brew "luarocks"
brew "python3"
brew "uv"

# Data / Query Tools
brew "bat"
brew "csvq"
brew "jq"
brew "yq"

# Media
brew "yt-dlp"

# Casks (Blocks macOS from auto-loading iTunes/Apple Music)
cask "notunes"
